omakoto/raspberry-pi-pico/nsbackend-esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (XIAO ESP32-S3 standard 8MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom Partition Table with FATFS
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS 1kHz tick rate for precise sub-millisecond timers
CONFIG_FREERTOS_HZ=1000

# TinyUSB Configuration (1 HID Gamepad + 1 CDC ACM + 1 MSC Storage)
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096

# FATFS & Wear Levelling Configuration
CONFIG_FATFS_LFN_HEAP=y
CONFIG_WL_SECTOR_SIZE_512=y

# Networking & Stack sizing
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
